Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: This section of the documentation describes how the Editor can be installed and used.
it_it: Questa sezione della documentazione descrive come installare e utilizzare l'Editor.

source: This section of the documentation teaches all the details of each tool.
it_it: Questa sezione della documentazione illustra tutti i dettagli di ogni strumento.

source: This section overviews these components by describing their use and how they interact.
it_it: Questa sezione fornisce una panoramica di questi componenti, descrivendone l'utilizzo e le interazioni.

source: This section provides information about the steps to follow to get a custom application using LVGL running on the board.
it_it: Questa sezione fornisce informazioni sui passaggi da seguire per ottenere un'applicazione personalizzata che utilizzi LVGL in esecuzione sulla scheda.

source: This sets ``scr1`` as the Active Screen.
it_it: Questo imposta ``scr1`` come Screen Attivo.

source: This sets the width of the *content*, and the actual widget width will include padding and border.
it_it: Questo imposta la larghezza del *contenuto* e la larghezza effettiva del widget includerà il padding interno e il bordo.

source: This should also be done in the indev ``read_cb``.
it_it: Questa operazione dovrebbe essere eseguita anche nell'indev ``read_cb``.

source: This should show input devices and there will be entries with the word ``event`` which give a clue as to the device to use eg.
it_it: Questo dovrebbe mostrare i dispositivi di input e ci saranno voci con la parola ``event`` che forniscono un indizio sul dispositivo da utilizzare, ad esempio

source: This snippet adds LVGL and needs an ``lv_conf.h`` file present next to the lvgl folder:
it_it: Questo frammento aggiunge LVGL e necessita di un file ``lv_conf.h`` presente accanto alla cartella lvgl:

source: This snippet adds LVGL and specifies to use Kconfig as the configuration system and to use a specific defconfig:
it_it: Questo frammento aggiunge LVGL e specifica di utilizzare Kconfig come sistema di configurazione e di utilizzare un defconfig specifico:

source: This snippet adds LVGL and specifies to use Kconfig as the configuration system:
it_it: Questo frammento aggiunge LVGL e specifica di utilizzare Kconfig come sistema di configurazione:

source: This snippet sets up LVGL and points to the folder where ``lv_conf.h`` is located:
it_it: Questo frammento imposta LVGL e punta alla cartella in cui si trova ``lv_conf.h``:

source: This snippet sets up LVGL and tells it which ``lv_conf.h`` file to use:
it_it: Questo frammento imposta LVGL e gli indica quale file ``lv_conf.h`` utilizzare:

source: This strategy is good for linear reading of large files but less helpful for short random reads across a file bigger than the buffer since data will be buffered that will be discarded after the next seek and read.
it_it: Questa strategia è valida per la lettura lineare di file di grandi dimensioni, ma meno utile per letture "random" brevi su un file più grande del buffer, poiché verranno memorizzati nel buffer dati che verranno scartati dopo la successiva ricerca e lettura.

source: This string is copied by the Drop-Down List, so its contents do not need to remain available beyond this call.
it_it: Questa stringa viene copiata dalla Drop-Down List, quindi il suo contenuto non deve rimanere disponibile oltre questa chiamata.

source: This support requires OpenGL ES 2.0 with some extra extensions and provides comprehensive 3D rendering capabilities including PBR materials, animations, and interactive camera controls for embedded 3D visualization.
it_it: Questo supporto richiede OpenGL ES 2.0 con alcune estensioni aggiuntive e offre funzionalità di rendering 3D complete, tra cui materiali PBR, animazioni e controlli interattivi della telecamera per la visualizzazione 3D embedded.

source: This task runs with the current working directory **${S}** which is the compilation directory.
it_it: Questo viene eseguito con la directory di lavoro corrente **${S}**, che è la directory di compilazione.

source: This tool uses potrace to generate outlines from the bitmap information.
it_it: Questo strumento utilizza "potrace" per generare contorni dalle informazioni bitmap.

source: This type and format are used in almost all APIs regardless of :cpp:expr:`LV_COLOR_DEPTH`.
it_it: Questo tipo e formato sono utilizzati in quasi tutte le API, indipendentemente da :cpp:expr:`LV_COLOR_DEPTH`.

source: This type can be any custom type, for example, `type="my_data"`.
it_it: Questo tipo può essere qualsiasi tipo custom, ad esempio, `type="my_data"`.

source: This usually has a performance impact though and shouldn't be enabled unless really needed.
it_it: Questo di solito ha un impatto sulle prestazioni e non dovrebbe essere abilitato a meno che non sia realmente necessario.

source: This usually requires calling :cpp:expr:`lv_draw_sw_rgb565_swap(buf, buf_size_in_px)` inside the :ref:`flush_callback`, implementing a custom function to swap the bytes or using the correct color format.
it_it: Di solito, questo richiede la chiamata a :cpp:expr:`lv_draw_sw_rgb565_swap(buf, buf_size_in_px)` all'interno di :ref:`flush_callback`, l'implementazione di una funzione personalizzata per scambiare i byte o l'utilizzo del formato colore corretto.

source: This value is set to ``1`` by default.
it_it: Questo valore è impostato su ``1`` per default.

source: This variable can have two separate functions depending on the context: a recipe name or a resulting package name.
it_it: Questa variabile può avere due funzioni distinte a seconda del contesto: un nome di ricetta o un nome di pacchetto risultante.

source: This variation over time can be linear (default), it can be on a path (curve) that you specify, and there is even a variety of commonly-used non-linear effects that can be specified.
it_it: Questa variazione nel tempo può essere lineare (impostazione predefinita), può essere lungo un percorso (curva) specificato dall'utente ed è persino possibile specificare una varietà di effetti non lineari di uso comune.

source: This way even if a wrapper item is used in the grid, it can be made "transparent" from the grid's point of view.
it_it: In questo modo, anche se nella grid viene utilizzato un elemento wrapper, può essere reso "trasparente" dal punto di vista della grid.

source: This way, if the Widget with gridnav has focus, the arrow key presses are automatically forwarded to the Widget so that gridnav can process the arrow keys.
it_it: In questo modo, se il Widget con gridnav ha il focus, le pressioni dei tasti freccia vengono automaticamente inoltrate al Widget in modo che gridnav possa elaborarle.

source: This way, only a pointer to ``txt`` will be stored.
it_it: In questo modo, verrà memorizzato solo un puntatore a ``txt``.

source: This way, the channels can be managed separately in an elegant manner.
it_it: In questo modo, i canali possono essere gestiti separatamente in modo elegante.

source: This way, when the widget is deleted, it will be automatically unsubscribed.
it_it: In questo modo, quando il widget viene eliminato, la sua sottoscrizione verrà automaticamente annullata.

source: This will activate the `Configuration Window`.
it_it: Questo attiverà la `Configuration Window`.

source: This will add the lvgl library in the generated image, and it will also add the library to the host SDK we will generate later on.
it_it: Questo aggiungerà la libreria lvgl all'immagine generata e la aggiungerà anche all'SDK host che genereremo in seguito.

source: This will allocate a buffer dynamically, and the provided string will be copied into that buffer.
it_it: Questo allocherà un buffer dinamicamente e la stringa fornita verrà copiata in quel buffer.

source: This will automatically add the library to the lib_deps section of your project’s ``platformio.ini``
it_it: Questo aggiungerà automaticamente la libreria alla sezione lib_deps del file ``platformio.ini`` del progetto.

source: This will automatically open the Editor (if installed to the `/Applications` folder) on MacOS.
it_it: Verrà automaticamente aperto l'Editor (se installato nella cartella `/Applications`) su MacOS.

source: This will be used as its background color, border color, and shadow color.
it_it: Questo verrà utilizzato come colore di sfondo, colore del bordo e colore dell'ombra.

source: This will be useful for later.
it_it: Questo sarà utile in seguito.

source: This will build LVGL and render the UI in a VSCode tab.
it_it: Questo compilerà LVGL e "renderizzerà" l'interfaccia utente in una scheda VSCode.

source: This will cause an MCU exception by attempting to modify program memory (ROM).
it_it: Ciò causerà un'eccezione MCU tentando di modificare la memoria di programma (ROM).

source: This will convert the file and open a "Save As..." dialog box.
it_it: Questo convertirà il file e aprirà una finestra di dialogo "Save As...".

source: This will create a log file called ``debug`` in the ``/tmp`` directory, copy-paste the content of the file in the github issue.
it_it: Questo creerà un file di log chiamato ``debug`` nella directory ``/tmp``, eseguire il copia e incolla del contenuto del file nell'issue su GitHub.

source: This will create a script ``build/tmp/deploy/sdk/poky-glibc-x86_64-core-image-base-cortexa53-raspberrypi3-64-toolchain-5.0.4.sh``.
it_it: Questo creerà uno script ``build/tmp/deploy/sdk/poky-glibc-x86_64-core-image-base-cortexa53-raspberrypi3-64-toolchain-5.0.4.sh``.

source: This will decompress ``cogwheel.png``, and then re-compress it using LZ4 and write the output to ``./output/cogwheel.bin``.
it_it: Questo decomprimerà ``cogwheel.png``, quindi lo ricomprimerà utilizzando LZ4 e scriverà l'output in ``./output/cogwheel.bin``.

source: This will decompress ``cogwheel.png``, and then re-compress it using RLE and write the output to ``./output/cogwheel.bin``.
it_it: Questo decomprimerà ``cogwheel.png``, quindi lo ricomprimerà utilizzando RLE e scriverà l'output in ``./output/cogwheel.bin``.

source: This will execute all the previous described tasks.
it_it: Questo eseguirà tutte le attività descritte in precedenza.

source: This will give a default appearance to the UI which can then be modified by adding further styles.
it_it: Questo darà un aspetto predefinito all'interfaccia utente, che potrà poi essere modificato aggiungendo ulteriori stili.

source: This will include all LVGL ``demos`` and ``examples`` in the build.
it_it: Questo includerà tutti i ``demos`` e gli ``examples`` di LVGL nella build.

source: This will include several things, but setting its ``evaluate_cb`` and ``dispatch_cb`` callbacks (mentioned later) are two of them.
it_it: Questo includerà diverse cose, ma l'impostazione delle callback ``evaluate_cb`` e ``dispatch_cb`` (menzionate più avanti) sono due di queste.

source: This will increment ``subject1`` by 5 when ``button1`` is clicked, stopping at the limits set by the min/max values of the event or :cpp:expr:`lv_subject_set_min_value_int()` and :cpp:expr:`lv_subject_set_max_value_int()` (same for float subjects).
it_it: Questo incrementerà ``subject1`` di 5 quando si clicca su ``button1``, fermandosi ai limiti impostati dai valori min/max dell'evento o da :cpp:expr:`lv_subject_set_min_value_int()` e :cpp:expr:`lv_subject_set_max_value_int()` (o stesso vale per i subject float).

source: This will iterate over the recognizers and stop once it detects a recognized or ended gesture.
it_it: Questa operazione itererà sui riconoscitori e si fermerà una volta rilevato un gesto riconosciuto o terminato.

source: This will return a pointer to a :ref:`base_widget` where the tab's content can be created.
it_it: Questo restituirà un puntatore a un :ref:`base_widget` in cui è possibile creare il contenuto della scheda.

source: This will swap the horizontal and vertical resolutions internally according to the set degree; however, it will not perform the actual rotation.
it_it: Questo invertirà internamente la risoluzione orizzontale e verticale in base al grado impostato; tuttavia, non eseguirà la rotazione effettiva.

source: This will toggle `subject1` between 0 and 1 each time `button1` is clicked.
it_it: Questo alterna `subject1` tra 0 e 1 ogni volta che si clicca su `button1`.

source: This works exactly like the above method except that when the Widget is deleted, the Observer thus created will be automatically unsubscribed from the Subject and deleted from the LVGL heap.
it_it: Funziona esattamente come il metodo precedente, tranne per il fatto che, quando il Widget viene eliminato, l'Observer così creato verrà automaticamente rimosso dall'iscrizione al Subject e cancellato dall'heap LVGL.

source: This works fine, but the indev read callback is constantly polling a flag which may go for long periods unset.
it_it: Questo funziona bene, ma la callback di lettura indev interroga costantemente un flag che potrebbe rimanere non impostato per lunghi periodi.

source: This works much like when you select text on your PC by clicking and dragging with your mouse or other pointer input device.
it_it: Funziona in modo molto simile a quando si seleziona del testo sul PC cliccando e trascinando con il mouse o un altro dispositivo di input puntatore.

source: Those that change them place the data in an inconsistent state during call execution (because such changes are multi-step sequences), but return them to a consistent state before those functions return.
it_it: Quelle che le modificano pongono i dati in uno stato incoerente durante l'esecuzione della chiamata (perché tali modifiche sono sequenze multi-step), ma li riportano a uno stato coerente prima che tali funzioni terminino.

source: Thread Priority
it_it: Priorità dei Thread

source: Threading Considerations
it_it: Considerazioni sui Thread

source: Three Buffers
it_it: Tre Buffer

source: Thresholds
it_it: Soglie

source: Thus you need to allocate the buffers and assign them to the display object as usual by calling :cpp:func:`lv_display_set_buffers`.
it_it: Pertanto è necessario allocare i buffer e assegnarli all'oggetto di visualizzazione come di consueto chiamando :cpp:func:`lv_display_set_buffers`.

source: Thus, :c:macro:`LV_USE_TABLE` macro must be set to a non-zero value in ``lv_conf.h`` in order to use ``lv_file_explorer``, and and :c:macro:`LV_USE_LIST` must be set to a non-zero value to use the "Quick-Access" panel.
it_it: Pertanto, la macro :c:macro:`LV_USE_TABLE` deve essere impostata su un valore diverso da zero in ``lv_conf.h`` per poter utilizzare ``lv_file_explorer``, e :c:macro:`LV_USE_LIST` deve essere impostata su un valore diverso da zero per utilizzare il pannello "Quick-Access".

source: Thus, doing this:
it_it: Quindi, procedendo in questo modo:

source: Thus, if the value is set to maximum, the indicator Arc will cover the entire "background" Arc.
it_it: Quindi, se il valore è impostato sul massimo, l'indicatore coprirà l'intero Arco "di sfondo".

source: Thus, the size of the Label is automatically expanded to the text size + padding + border width.
it_it: In questo modo, la dimensione dell'etichetta viene automaticamente espansa in base alla dimensione del testo + padding + spessore del bordo.

source: Thus, you can have a Button's width being changed by one Animation while having its height being changed by another Animation.
it_it: Quindi, è possibile che la larghezza di un Pulsante venga modificata da un'Animazione e la sua altezza da un'altra Animazione.

source: Tick Interface
it_it: Interfaccia ai Tick

source: Tick drawing order
it_it: Ordine di disegno delle tacche

source: Tick marks and labels
it_it: Segni di graduazione ed etichette

source: Tightening Tables
it_it: Restringimento di Tabelle

source: Tiled Rendering
it_it: Rendering a Riquadri

source: Tiled rendering only affects the rendering process, and the :ref:`flush_callback` is called once for each invalidated area.
it_it: Il rendering a riquadri influisce solo sul processo di rendering e la :ref:`flush_callback` viene chiamata una volta per ogni area invalidata.

source: Tiles the image (repeats it both horizontally and vertically) if the image is smaller than the `image_area` field in `lv_draw_image_dsc_t`.
it_it: Rielabora l'immagine (ripetendola sia orizzontalmente che verticalmente) se l'immagine è più piccola del campo `image_area` in `lv_draw_image_dsc_t`.

source: Tileview with content
it_it: Tileview con contenuto

source: Tiling, where the draw area is larger than the image.
it_it: Tiling, in cui l'area di disegno è più grande dell'immagine.

source: Time
it_it: Tempo

source: Timelines are composed of simple animations.
it_it: Le timeline sono composte da animazioni semplici.

source: Timelines can be defined inside ``<screen>``\ s and ``<component>``\ s.
it_it: Le timeline possono essere definite all'interno degli ``<screen>`` e dei ``<component>``.

source: Timelines can be triggered by events (e.g. click) using ``<play_timeline_event>`` as a child of any widget.
it_it: Le Timeline possono essere attivate da eventi (ad esempio un clic) utilizzando ``<play_timeline_event>`` come elemento figlio di qualsiasi widget.

source: Timer Handler
it_it: Gestione del Timer

source: Timer Handler Resume Callback
it_it: Callback di Ripristino del Gestore dei Timer

source: Timers
it_it: Timer

source: Timers are non-preemptive, which means a Timer cannot interrupt another Timer.
it_it: I Timer non sono "preemptive", il che significa che un Timer non può interrompere un altro Timer.

source: Timestamp configuration: LVGL uses the :cpp:func:`lv_tick_get` function with a precision of 1ms by default to obtain timestamps when events occur.
it_it: Configurazione del timestamp: LVGL utilizza la funzione :cpp:func:`lv_tick_get` con una precisione di 1 ms per default per ottenere timestamp quando si verificano eventi.

source: Tiny JPEG Decoder
it_it: Decoder Tiny JPEG

source: Tiny TTF Font Engine
it_it: Motore del Font Tiny TTF

source: TinyTTF fonts use the :ref:`tiny_ttf` engine to load TTF files directly or from data.
it_it: I font TinyTTF utilizzano il motore :ref:`tiny_ttf` per caricare i file TTF direttamente o dai dati.

source: Tips and tricks
it_it: Suggerimenti e trucchi

source: Title and buttons
it_it: Titolo e pulsanti

source: Title and content text: :ref:`lv_label`
it_it: Titolo e testo del contenuto: :ref:`lv_label`

source: Title on the header: :ref:`lv_label`
it_it: Titolo sull'intestazione: :ref:`lv_label`

source: To "connect" it to LVGL, use LVGL's *Image Decoder* interface.
it_it: Per "connetterla" a LVGL, si usa l'interfaccia*Image Decoder* di LVGL.

source: To account for this, reserve extra free space on top of the Keyboard or ensure that the Keyboard is added *after* any Widgets adjacent to its top boundary (placing it "above" those Widgets) so that pop-overs will be drawn over them.
it_it: Per risolvere questo problema, riservare spazio libero extra sopra la Keyboard o assicurarsi che questa venga aggiunta *dopo* eventuali Widget adiacenti al suo limite superiore (posizionandola "sopra" tali Widget) in modo che i pop-over vengano visualizzati sopra di essi.

source: To achieve this:
it_it: Per ottenere questo risultato:

source: To add Arm2D to your project, follow these steps:
it_it: Per aggiungere Arm2D al progetto, seguire questi passaggi:

source: To add LVGL to your Makefile based build system add these lines to your main Makefile:
it_it: Per aggiungere LVGL al sistema basato su Makefile, si aggiungono queste righe al Makefile principale:

source: To add a display or touch driver to your project, use a command like:
it_it: Per aggiungere un driver di display o touch al progetto, utilizzare un comando come:

source: To add a driver, a :cpp:type:`lv_fs_drv_t` object needs to be initialized and registered in a way similar to the code below.
it_it: Per aggiungere un driver, è necessario inizializzare e registrare un oggetto :cpp:type:`lv_fs_drv_t` in modo simile al codice seguente.

source: To add a new font engine, a custom :cpp:type:`lv_font_t` variable needs to be created:
it_it: Per aggiungere un nuovo motore di font, è necessario creare una variabile personalizzata :cpp:type:`lv_font_t`:

source: To add a style to a Widget use ``lv_obj_add_style(widget, &style, <selector>)``.
it_it: Per aggiungere uno stile a un Widget, utilizzare ``lv_obj_add_style(widget, &style, <selector>)``.

source: To add gridnav behavior to any Widget (e.g. one serving as a container for child Widgets that the end user will navigate among using arrow keys) use :cpp:expr:`lv_gridnav_add(container, flags)`.
it_it: Per aggiungere il comportamento di GridNav a qualsiasi Widget (ad esempio, uno che funge da contenitore per i Widget figli tra cui l'utente finale navigherà utilizzando i tasti freccia), si usa :cpp:expr:`lv_gridnav_add(container, flags)`.

source: To add it to your project, use the following command:
it_it: Per aggiungerlo al progetto, si usa il seguente comando:

source: To add layers to the project there are 2 options:
it_it: Per aggiungere layer al progetto ci sono 2 opzioni:

source: To add links with custom link text use
it_it: Per aggiungere link con testo personalizzato, utilizzare

source: To add styles to it use :cpp:expr:`lv_dropdown_get_list(dropdown)` to get the list object.
it_it: Per aggiungere stili, si usa :cpp:expr:`lv_dropdown_get_list(dropdown)` per ottenere l'oggetto elenco.

source: To add wide characters like ``'á'``, ``'ß'`` or CJK characters, use :cpp:expr:`lv_textarea_add_text(textarea, "á")`.
it_it: Per aggiungere caratteri estesi come ``'á'``, ``'ß'`` o caratteri CJK, si usa :cpp:expr:`lv_textarea_add_text(textarea, "á")`.

source: To add your changes you can edit files online on GitHub and send a new Pull request from there (recommended for small changes) or add the updates in your favorite editor/IDE and use ``git`` to publish the changes (recommended for more complex updates).
it_it: Per aggiungere le modifiche, si possono modificare i file online su GitHub e inviare una nuova richiesta Pull da lì (consigliato per piccole modifiche) oppure aggiungere gli aggiornamenti nel proprio editor/IDE e usare ``git`` per pubblicare le modifiche (consigliato per aggiornamenti più complessi).

source: To address these issues, LVGL introduces a powerful Widget naming system that can be enabled by setting ``LV_USE_OBJ_NAME`` in ``lv_conf.h``.
it_it: Per risolvere questi problemi, LVGL introduce un potente sistema di denominazione dei Widget abilitabile impostando ``LV_USE_OBJ_NAME`` in ``lv_conf.h``.

source: To address this, LVGL can divide large areas that need to be updated into smaller tiles.
it_it: Per risolvere questo problema, LVGL può suddividere le aree estese che devono essere aggiornate in "tile" [riquadri] più piccoli.

source: To assign Hardware Buttons to coordinates, use :cpp:expr:`lv_indev_set_button_points(my_indev, points_array)`.
it_it: Per assegnare i "Pulsanti Hardware" alle coordinate, si usa :cpp:expr:`lv_indev_set_button_points(my_indev, points_array)`.

source: To assign a buffer to a Canvas, use :cpp:expr:`lv_canvas_set_buffer(canvas, buffer, width, height, LV_COLOR_FORMAT_...)`.
it_it: Per assegnare un buffer a un Canvas, si usa :cpp:expr:`lv_canvas_set_buffer(canvas, buffer, width, height, LV_COLOR_FORMAT_...)`.

source: To assign the Text Area, use :cpp:expr:`lv_keyboard_set_textarea(kb, text_area)`.
it_it: Per assegnarla, si usa :cpp:expr:`lv_keyboard_set_textarea(kb, text_area)`.

source: To associate a group with an input device, use :cpp:expr:`lv_indev_set_group(indev, g)`.
it_it: Per associare un gruppo a un dispositivo di input, si usa :cpp:expr:`lv_indev_set_group(indev, g)`.
